function funNumbers(num) {
//     if (typeof num === "string")
//         throw "Данная функция обрабатывает только числовые значения, Вы ввели строку. Введите, пожалуйста, число";
//     if (typeof num === "boolean")
//         throw "Данная функция обрабатывает только числовые значения, Вы ввели булевое значение. Введите, пожалуйста, число";
//     if (typeof num === "object")
//         throw "Данная функция обрабатывает только числовые значения, Вы ввели объект. Введите, пожалуйста, число";
//     if (typeof num === "function")
//         throw "Данная функция обрабатывает только числовые значения, Вы ввели функцию. Введите, пожалуйста, число";
//     if (typeof num === "undefined")
//         throw "Данная функция обрабатывает только числовые значения, Вы ввели данные неопределнного типа. Введите, пожалуйста, число";    
//     if (num % 5 == 0) {
//         console.log(num + " делится на 5.");
//     } else if (num % 11 == 0) {
//         console.log(num + " делится на 11.");
//     } else {
//         console.log(num + " - скучное число.");
//     }
// }
// try {
//     funNumbers("дормормрм"); //введите значение в скобки
// } catch(ex) {
//     console.log(ex);
// }